In [8]:
import pandas as pd
data_list = [10, 20, 30, 40]
series_list = pd.Series(data_list)

print(series_list)
series_list.head(1) #default is 5 rows, but we can specify the number of rows to display
series_list.tail()

series_list.info() #gives a concise summary of the Series
series_list.describe() #provides descriptive statistics of the Series

0    10
1    20
2    30
3    40
dtype: int64
<class 'pandas.core.series.Series'>
RangeIndex: 4 entries, 0 to 3
Series name: None
Non-Null Count  Dtype
--------------  -----
4 non-null      int64
dtypes: int64(1)
memory usage: 164.0 bytes

count     4.000000
mean     25.000000
std      12.909944
min      10.000000
25%      17.500000
50%      25.000000
75%      32.500000
max      40.000000
dtype: float64

In [9]:
students_data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace', 'Henry', 'Ivy', 'Jack'],
    'Age': [20, 22, 21, 23, 20, 22, 21, 23, 20, 22],
    'GPA': [3.8, 3.5, 3.9, 3.7, 3.6, 3.4, 3.8, 3.9, 3.7, 3.5],
    'Math_Score': [85, 78, 92, 88, 80, 75, 90, 95, 82, 79]
}
df = pd.DataFrame(students_data)
print(df.head(8))
df.info()
print(df.describe())

      Name  Age  GPA  Math_Score
0    Alice   20  3.8          85
1      Bob   22  3.5          78
2  Charlie   21  3.9          92
3    David   23  3.7          88
4      Eve   20  3.6          80
5    Frank   22  3.4          75
6    Grace   21  3.8          90
7    Henry   23  3.9          95
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        10 non-null     object
 1   Age         10 non-null     int64
 2   GPA         10 non-null     float64
 3   Math_Score  10 non-null     int64
dtypes: float64(1), int64(2), object(1)
memory usage: 452.0+ bytes
             Age        GPA  Math_Score
count  10.000000  10.000000    10.00000
mean   21.400000   3.680000    84.40000
std     1.173788   0.175119     6.65332
min    20.000000   3.400000    75.00000
25%    20.250000   3.525000    79.25000
50%    21.500000   3.700000    83.50000
75%    22.000000   3.800000    89.50000
max    23.000000   3.900000    95.00000

In [ ]:
import pandas as pd

employees = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank', 'Grace'],
    'Age': [28, 34, 29, 42, 36, 50, 45],
    'Address': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix', 'Philadelphia', 'San Antonio'],
    'Salary': [70000, 80000, 65000, 90000, 100000, 410000, 300000]
}

data_frame = pd.DataFrame(employees)
print("Original DataFrame:")
print(data_frame)


print("\n\nSelected rows (0-2) with specific columns:")
print(data_frame.loc[0:2, ['Name', 'Age', 'Address']])


data_frame['Major'] = ['Engineer', 'Doctor', 'Pharmacist', 'Engineer', 'Lawyer', 'Artist', 'Architect']
print("\n\nDataFrame after adding 'Major' column:")
print(data_frame)


data_frame['Salary'] = 10000
print("\n\nDataFrame after updating Salary to 10000:")
print(data_frame)


data_frame['Add'] = data_frame['Address']
print("\n\nDataFrame after duplicating Address to Add:")
print(data_frame)


data_frame = data_frame.drop('Address', axis=1)
print("\n\nFinal DataFrame after dropping 'Address' column:")
print(data_frame)

Original DataFrame:
      Name  Age       Address  Salary
0    Alice   28      New York   70000
1      Bob   34   Los Angeles   80000
2  Charlie   29       Chicago   65000
3    David   42       Houston   90000
4      Eva   36       Phoenix  100000
5    Frank   50  Philadelphia  410000
6    Grace   45   San Antonio  300000


Selected rows (0-2) with specific columns:
      Name  Age      Address
0    Alice   28     New York
1      Bob   34  Los Angeles
2  Charlie   29      Chicago


DataFrame after adding 'Major' column:
      Name  Age       Address  Salary       Major
0    Alice   28      New York   70000    Engineer
1      Bob   34   Los Angeles   80000      Doctor
2  Charlie   29       Chicago   65000  Pharmacist
3    David   42       Houston   90000    Engineer
4      Eva   36       Phoenix  100000      Lawyer
5    Frank   50  Philadelphia  410000      Artist
6    Grace   45   San Antonio  300000   Architect


DataFrame after updating Salary to 10000:
      Name  Age       Address  Salary       Major
0    Alice   28      New York   10000    Engineer
1      Bob   34   Los Angeles   10000      Doctor
2  Charlie   29       Chicago   10000  Pharmacist
3    David   42       Houston   10000    Engineer
4      Eva   36       Phoenix   10000      Lawyer
5    Frank   50  Philadelphia   10000      Artist
6    Grace   45   San Antonio   10000   Architect


DataFrame after duplicating Address to Add:
      Name  Age       Address  Salary       Major           Add
0    Alice   28      New York   10000    Engineer      New York
1      Bob   34   Los Angeles   10000      Doctor   Los Angeles
2  Charlie   29       Chicago   10000  Pharmacist       Chicago
3    David   42       Houston   10000    Engineer       Houston
4      Eva   36       Phoenix   10000      Lawyer       Phoenix
5    Frank   50  Philadelphia   10000      Artist  Philadelphia
6    Grace   45   San Antonio   10000   Architect   San Antonio


Final DataFrame after dropping 'Address' column:
      Name  Age  Salary       Major           Add
0    Alice   28   10000    Engineer      New York
1      Bob   34   10000      Doctor   Los Angeles
2  Charlie   29   10000  Pharmacist       Chicago
3    David   42   10000    Engineer       Houston
4      Eva   36   10000      Lawyer       Phoenix
5    Frank   50   10000      Artist  Philadelphia
6    Grace   45   10000   Architect   San Antonio

In [17]:
import pandas as pd
df = pd.read_csv("employees.csv")
df

   ID           Name Department  Age  Salary Joining_Date
0   1       John Doe         HR   28   50000   2020-05-21
1   2     Jane Smith         IT   34   75000   2019-06-12
2   3    Bob Johnson    Finance   45   85000   2018-07-15
3   4    Alice White         IT   29   72000   2021-01-04
4   5  Charlie Brown  Marketing   32   68000   2019-11-30
5   6      Eva Green         HR   41   54000   2017-04-22
6   7     Mike Davis    Finance   50   90000   2016-08-19
7   8   Linda Taylor         IT   26   64000   2022-02-10
8   9   James Wilson  Marketing   38   70000   2020-09-08
9  10    Sarah Adams         HR   30   55000   2021-03-18

In [13]:
df.tail()

   ID          Name Department  Age  Salary Joining_Date
5   6     Eva Green         HR   41   54000   2017-04-22
6   7    Mike Davis    Finance   50   90000   2016-08-19
7   8  Linda Taylor         IT   26   64000   2022-02-10
8   9  James Wilson  Marketing   38   70000   2020-09-08
9  10   Sarah Adams         HR   30   55000   2021-03-18

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            10 non-null     int64
 1   Name          10 non-null     object
 2   Department    10 non-null     object
 3   Age           10 non-null     int64
 4   Salary        10 non-null     int64
 5   Joining_Date  10 non-null     object
dtypes: int64(3), object(3)
memory usage: 612.0+ bytes

In [15]:
df.describe()

             ID        Age        Salary
count  10.00000  10.000000     10.000000
mean    5.50000  35.300000  68300.000000
std     3.02765   7.958922  13106.826042
min     1.00000  26.000000  50000.000000
25%     3.25000  29.250000  57250.000000
50%     5.50000  33.000000  69000.000000
75%     7.75000  40.250000  74250.000000
max    10.00000  50.000000  90000.000000